# -*- coding: utf-8 -*-
from __future__ import absolute_import, unicode_literals
import pytest
from pymorphy2 import tagger

TEST_DATA = [
    ('КОШКА', ['КОШКА']),
    ('КОШКЕ', ['КОШКА']),
    ('СТАЛИ', ['СТАЛЬ', 'СТАТЬ']),

    ('ПСЕВДОКОШКА', ['ПСЕВДОКОШКА']),
    ('ПСЕВДОКОШКОЙ', ['ПСЕВДОКОШКА']),

    ('НАИСТАРЕЙШИЙ', ['СТАРЫЙ']),
    ('СВЕРХНАИСТАРЕЙШИЙ', ['СВЕРХСТАРЫЙ']),
    ('СВЕРХНАИСТАРЕЙШИЙ', ['СВЕРХСТАРЫЙ']),
    ('КВАЗИПСЕВДОНАИСТАРЕЙШЕГО', ['КВАЗИПСЕВДОСТАРЫЙ']),
    ('НЕБЕСКОНЕЧЕН', ['НЕБЕСКОНЕЧНЫЙ']),

    ('МЕГАКОТУ', ['МЕГАКОТ']),
    ('МЕГАСВЕРХНАИСТАРЕЙШЕМУ', ['МЕГАСВЕРХСТАРЫЙ']),

    ('КОТЁНОК', ['КОТЁНОК']),
    ('КОТЕНОК', ['КОТЁНОК']),
    ('ТЯЖЕЛЫЙ', ['ТЯЖЁЛЫЙ']),
    ('ЛЕГОК', ['ЛЕГКИЙ']),

    ('ОНА', ['ОНА']),
    ('ЕЙ', ['ОНА']),
    ('Я', ['Я']),
    ('МНЕ', ['Я']),

    ('НАИНЕВЕРОЯТНЕЙШИЙ', ['ВЕРОЯТНЫЙ']),
    ('ЛУЧШИЙ', ['ХОРОШИЙ']),
    ('НАИЛУЧШИЙ', ['ХОРОШИЙ']),
    ('ЧЕЛОВЕК', ['ЧЕЛОВЕК']),
    ('ЛЮДИ', ['ЧЕЛОВЕК']),

    ('ТРИЖДЫЧЕРЕЗПИЛЮЛЮОКНАМИ', ['ТРИЖДЫЧЕРЕЗПИЛЮЛЮОКНА']),
    ('РАЗКВАКАЛИСЬ',['РАЗКВАКАТЬСЯ']),
    ('КАШИВАРНЕЕ', ['КАШИВАРНЫЙ']),
    ('ДЕПЫРТАМЕНТОВ',['ДЕПЫРТАМЕНТ']),
    ('ИЗМОХРАТИЛСЯ',['ИЗМОХРАТИТЬСЯ']),

    ('БУТЯВКОЙ',['БУТЯВКА']), # и никаких местоимений!
    ('САПАЮТ',['САПАТЬ']), # и никаких местоимений!

    ('КЛЮЕВУ', ['КЛЮЕВ']),
    ('КЛЮЕВА', ['КЛЮЕВ']),

    ('ГУЛЯЛ', ['ГУЛЯТЬ']),
    ('ГУЛЯЛА', ['ГУЛЯТЬ']),
    ('ГУЛЯЕТ', ['ГУЛЯТЬ']),
    ('ГУЛЯЮТ', ['ГУЛЯТЬ']),
    ('ГУЛЯЛИ', ['ГУЛЯТЬ']),
    ('ГУЛЯТЬ', ['ГУЛЯТЬ']),

    ('ГУЛЯЮЩИЙ', ['ГУЛЯТЬ']),
    ('ГУЛЯВШИ', ['ГУЛЯТЬ']),
    ('ГУЛЯЯ', ['ГУЛЯТЬ']),
    ('ГУЛЯЮЩАЯ', ['ГУЛЯТЬ']),
    ('ЗАГУЛЯВШИЙ', ['ЗАГУЛЯВШИЙ']),

    ('КРАСИВЫЙ', ['КРАСИВЫЙ']),
    ('КРАСИВАЯ', ['КРАСИВЫЙ']),
    ('КРАСИВОМУ', ['КРАСИВЫЙ']),
    ('КРАСИВЫЕ', ['КРАСИВЫЙ']),

    ('ДЕЙСТВИЕ', ['ДЕЙСТВИЕ']),
]

morph = tagger.Morph.load()

def with_test_data(data):
    return pytest.mark.parametrize(
        ("word", "parse_result"),
        data
    )

@with_test_data(TEST_DATA)
def test_normal_forms(word, parse_result):
    assert morph.normal_forms(word) == parse_result
